fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВКМ_ДобавитьРеквизитыАбонДоговораНаФорму()	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВКМ_ДобавитьРеквизитыАбонДоговораНаФорму()

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьРеквизитыАбонДоговораНаФорму()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ДобавитьНовыеЭлементы();

	Иначе
		ГруппаДоговор = Элементы.Найти("ВКМ_ГруппаАбонентскийДоговор");
		Если ГруппаДоговор = Неопределено Тогда
			Возврат;
		Иначе
			Элементы.Удалить(ГруппаДоговор);
		КонецЕсли;
		
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыеЭлементы()
	
	ГруппаАбонентскийДоговор = Элементы.Добавить("ВКМ_ГруппаАбонентскийДоговор", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаАбонентскийДоговор.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонентскийДоговор.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаАбонентскийДоговор.ОтображатьЗаголовок = Ложь;
	ГруппаАбонентскийДоговор.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ГруппаДатыДоговора = Элементы.Добавить("ВКМ_ГруппаДатыДоговора", Тип("ГруппаФормы"), ГруппаАбонентскийДоговор);
	ГруппаДатыДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДатыДоговора.Заголовок = "Период действия договора";
	ГруппаДатыДоговора.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ГруппаДатыДоговора.ОтображатьЗаголовок = Истина;
	ГруппаДатыДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачалаДоговора", Тип("ПолеФормы"), ГруппаДатыДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "с";
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДоговора";

	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончанияДоговора", Тип("ПолеФормы"), ГруппаДатыДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "по";
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДоговора";

	НовыйЭлемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаАбонентскийДоговор);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "СуммаАбонентскойПлаты";
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";

	НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"), ГруппаАбонентскийДоговор);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "СтоимостьЧаса";
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	
КонецПроцедуры

#КонецОбласти
